In [1]:
import pandas as pd
from mysql_database import database

# 1. Find out how return that we have recived and with a product id

In [3]:
from mysql_database import database
query='''select `Product Name`,Status,count(*) from orders inner join returns 
       on orders.`Order ID`=returns.`Order ID` group by `Product Name`'''
mydb=database.create_database_connection()
results=database.read_query(mydb, query)

MySQL Database connection successful

In [4]:
results_pd=pd.DataFrame(results)

In [5]:
results_pd.rename(columns = {0:'Product Name',1:'Status',2:'Quantity'}, inplace = True)

In [6]:
results_pd

                                         Product Name    Status  Quantity
0               Dixon My First Ticonderoga Pencil, #2  Returned         1
1                                           Avery 493  Returned         1
2                               EcoTones® Memo Sheets  Returned         1
3                                           Newell 35  Returned         1
4                   Staples SlimLine Pencil Sharpener  Returned         1
..                                                ...       ...       ...
89  Snap-A-Way® Black Print Carbonless Ruled Speed...  Returned         1
90  Recycled Steel Personal File for Standard File...  Returned         1
91                                         Xerox 1980  Returned         1
92                                   TDK 4.7GB DVD+RW  Returned         1
93                        SAFCO Folding Chair Trolley  Returned         1

[94 rows x 3 columns]

# 4 . try to join order and return data both in sql

In [37]:
from mysql_database import database
query='''select distinct users.Region,manager from orders,users where orders.region=users.region'''
mydb=database.create_database_connection()
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

MySQL Database connection successful

In [39]:
results_pd.rename(columns = {0:'Region',1:'Manager',2:'Quantity'}, inplace = True)
results_pd

    Region  Manager
0  Central    Chris
1     West  William
2     East     Erin
3    South      Sam

# 5 . Try to find out how many unique customer that we have

In [40]:
from mysql_database import database
query='''select count(distinct `Customer Name`) from Orders'''
mydb=database.create_database_connection()
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

MySQL Database connection successful

In [41]:
results_pd.rename(columns = {0:'Total no of unique Customer'}, inplace = True)
results_pd

   Total no of unique Customer
0                         2703

# 6 . try to find out in how many regions we are selling a product and who is a manager for a respective region

In [42]:
from mysql_database import database
query='''select distinct users.Region,manager from orders,users where orders.region=users.region'''
mydb=database.create_database_connection()
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

MySQL Database connection successful

In [43]:
results_pd.rename(columns = {0:'Region',1:'Manager'}, inplace = True)
results_pd

    Region  Manager
0  Central    Chris
1     West  William
2     East     Erin
3    South      Sam

# 7 . find out how many different differnet shipement mode that we have and what is a percentage usablity of all the shipment mode

In [44]:
from mysql_database import database
query='''select `Ship Mode`,(count(*)/9426)*100 from orders group by `Ship Mode`'''
mydb=database.create_database_connection()
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

MySQL Database connection successful

In [45]:
results_pd.rename(columns = {0:'Ship Mode',1:'usablity'}, inplace = True)
results_pd

        Ship Mode usablity
0     Regular Air  74.6446
1     Express Air  11.7441
2  Delivery Truck  13.6113

# 8 . Create a new coulmn and try to find our a diffrence between order date and shipment date

In [47]:
from mysql_database import database
query='''alter table orders add column Diff_Days integer'''
mydb=database.create_database_connection()
database.execute_query(mydb, query)

MySQL Database connection successful
Query executed successfully...

# 9 . base on question number 8 find out for which order id we have shipment duration more than 10 days

In [7]:
query='''select `Order ID`,Diff_Days from orders where Diff_Days>10'''
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

In [9]:
results_pd.rename(columns = {0:'Order ID',1:'Diff_Days'}, inplace = True)
results_pd

    Order ID  Diff_Days
0      87215         84
1      86318         11
2      86318         15
3      87957         17
4      87957         11
5      87957         28
6      19556         17
7      19556         11
8      19556         28
9      86177         92
10     88223         14
11     88352         17
12     87572         22
13     91294         24
14     86434         18
15     86436         17
16     86436         19
17     87300         19
18     19841         27
19     19841         31
20     19841         19
21     87300         27
22     87300         31

# 10 Try to find out a list of a returned order which sihpment duration was more then 15 days and find out that region manager as well

In [10]:
query='''select orders.`Order ID`,orders.Region,Diff_Days,Manager,Status from orders,returns,users where 
orders.`Order ID`=returns.`Order ID` and orders.Region=users.region and Diff_Days>15'''
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

In [12]:
results_pd.rename(columns = {0:'Order ID',1:'Region',2:'Manager',3:'Status'}, inplace = True)
results_pd

Empty DataFrame
Columns: []
Index: []

# 11 . Gorup by region and find out which region is more profitable

In [13]:
query='''select Region,sum(Profit),sum(Sales),sum(`Quantity ordered new`) from orders group by region'''
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

In [14]:
results_pd.rename(columns = {0:'Region',1:'Profit',2:'Sales',3:'Quantity ordered'}, inplace = True)
results_pd

    Region         Profit       Sales Quantity ordered
0  Central  519825.567067  2540341.62            38083
1     West  310849.453897  2391438.80            33739
2     East  377566.186045  2422804.68            34833
3    South  104201.192420  1597346.22            23409

# 12 . Try to find out overalll in which country we are giving more didscount

In [15]:
query='''select `State or Province`,max(discount)*100 from orders  
where discount*100=(select max(discount)*100 from orders) group by `State or Province`'''
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

In [16]:
results_pd.rename(columns = {0:'State or Province',1:'Discount'}, inplace = True)
results_pd

  State or Province  Discount
0          Illinois      25.0

# 13 . Give me a list of unique postal code

In [17]:
query='''select distinct `Postal Code` from orders'''
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

In [18]:
results_pd.rename(columns = {0:'Postal Code'}, inplace = True)
results_pd

      Postal Code
0           60101
1           98221
2           91776
3           95123
4            2724
...           ...
1692         6820
1693        60014
1694        61832
1695        62521
1696        26554

[1697 rows x 1 columns]

# 14 . which customer segement is more profitalble find it out .

In [19]:
query='''select `Customer Segment`,sum(profit) from orders group by `Customer Segment`'''
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

In [20]:
results_pd.rename(columns = {0:'Customer Segment',1:'Profit'}, inplace = True)
results_pd

  Customer Segment         Profit
0        Corporate  505538.627783
1      Home Office  283869.553814
2   Small Business  316474.592482
3         Consumer  206559.625348

# 15 . try to find out the 10th most loss making product catagory .

In [21]:
query='''select `Product Category`,sum(Profit_Margin) from orders group by `Product Category` 
order by sum(Profit_Margin) LIMIT 1'''
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

In [22]:
results_pd.rename(columns = {0:'Product Category',1:'Profit_Margin'}, inplace = True)
results_pd

  Product Category  Profit_Margin
0  Office Supplies -111320.452758

# 16 . Try to find out 10 top product with highest margins

In [23]:
query=''' select `Product Name`,sum(Profit_Margin) from orders group by `Product Name` 
order by sum(Profit_Margin) desc LIMIT 10'''
results=database.read_query(mydb, query)
results_pd=pd.DataFrame(results)

In [24]:
results_pd.rename(columns = {0:'Product Name',1:'Profit_Margin'}, inplace = True)
results_pd

                                        Product Name  Profit_Margin
0                   Avery White Multi-Purpose Labels   99949.179470
1                Rediform S.O.S. Phone Message Books   75693.907998
2                                          Avery 506   20936.706212
3  Telephone Message Books with Fax/Mobile Sectio...   17960.194899
4                                          Avery 501   13676.074214
5                                           Avery 51   11879.854477
6            Plymouth Boxed Rubber Bands by Plymouth   10485.428178
7                                         Xerox 1981    9914.039824
8                   Staples 4 Outlet Surge Protector    9592.155970
9                          GBC Plastic Binding Combs    9095.879457